#include <iostream>
using namespace std;
int main() {
//Boolean1◦.Дано целое число A.Проверить истинность высказывания : «Число A является положительным».
//	int a;
//	bool r;
//	cin >> a;
//	r = a > 0;
//	cout << boolalpha << r;
//Boolean2◦.Дано целое число A.Проверить истинность высказывания : «Число A является нечетным».
//	int a;
//	bool r;
//	cin >> a;
//	r = a % 2 != 0;
//	cout << boolalpha << r;
//Boolean3◦Дано целое число A.Проверить истинность высказывания : «Число A является четным».
//	int a;
//	bool r;
//	cin >> a;
//	r = a % 2 = = 0;
//Boolean4◦Даны два целых числа : A, B.Проверить истинность высказывания :«Справедливы неравенства A > 2 и B ≤ 3».
//	int a, b;
//	bool r;
//	cin >> a >> b;
//	r = a > 2 && b <= 3;
//	cout << boolalpha << r;*/
//Boolean5◦Даны два целых числа : A, B.Проверить истинность высказывания : «Справедливы неравенства A ≥ 0 или B < −2».
//	int a, b;
//	bool r;
//	cin >> a >> b;
//	r = a >= || b < -2;
//	cout << boolalpha << r;
//Boolean6◦Даны три целых числа : A, B, C.Проверить истинность высказывания : «Справедливо двойное неравенство A < B < C».
//	int a, b, c;
//	cin >> a >> b >> c;
//	bool r = a < b && b < c;
//	cout << boolalpha << r << endl;
//Boolean7◦Даны три целых числа : A, B, C.Проверить истинность высказывания : «Число B находится между числами A и C»
//	int a, b, c;
//	cin >> b >> a >> c;
//	bool r = b<a&& b>c;
//	cout << boolalpha << r << endl;
//Boolean8◦Даны два целых числа : A, B.Проверить истинность высказывания : «Каждое из чисел A и B нечетное».
/*	int a, b;
	cin >> b >> a;
	bool r = a % 2 != 0 && b % 2 != 0;
	cout << boolalpha << r << endl;*/
//Boolean9◦Даны два целых числа : A, B.Проверить истинность высказывания :«Хотя бы одно из чисел A и B нечетное».
/*	int a, b;
	cin>> a >> b;
	bool r = a % 2 != 0 || b % 2 != 0;
	cout << boolalpha << r << endl;*/
//Boolean10◦ Даны два целых числа : A, B.Проверить истинность высказывания : «Ровно одно из чисел A и B нечетное».
/*	int a, b;
	cin >> a >> b;
	bool r = a % 2 == 0 && b % 2 != 00 || a % 2 != 0 && b % 2 != 0;
	cout << boolalpha << r << endl;*/
//Boolean11◦Даны два целых числа : A, B.Проверить истинность высказывания : «Числа A и B имеют одинаковую четность».
/*	int a, b;
	cin >> a >> b;
	bool r = a % 2 == 0 && b % 2 = 00 || a % 2 != 0 && b % 2 != 0;
	cout << boolalpha << r << endl;*/
//Boolean12◦Даны три целых числа : A, B, C.Проверить истинность высказывания : «Каждое из чисел A, B, C положительное»
/*	int a, b, c;
	cin >> a >> b >> c;
	bool r = a > 0 && b > 0 && c > 0;
	cout << boolalpha << r << endl;*/
//Boolean13◦Даны три целых числа : A, B, C.Проверить истинность высказывания : «Хотя бы одно из чисел A, B, C положительное».
/*	int a, b, c;
	cin >> a >> b >> c;
	bool r = a > 0 || b > 0 || c > 0;
	cout << boolalpha << r << endl;*/
//Boolean14◦Даны три целых числа : A, B, C.Проверить истинность высказывания : «Ровно одно из чисел A, B, C положительное».
/*	int a, b, c;
	cin >> a >> b >> c;
	bool r = a > 0 && b < 0 && c < 0 || a < 0 && b>0 && c < 0 || a < 0 && b < 0 && c>0;
	cout << boolalpha << r << endl;*/
//Boolean15◦Даны три целых числа : A, B, C.Проверить истинность высказывания : «Ровно два из чисел A, B, C являются положительными».
	int a,b,c


	return 0;
}